{
  "title": "Pro-Pakistan demo outside Indian High Commission in London",
  "url": "https://www.dawn.com/news/1908274/pro-pakistan-demo-outside-indian-high-commission-in-london",
  "published_date": "Published\nMay 4, 2025\n \n\nUpdated\n\nMay 4, 2025\n08:08am",
  "summary": "Sadly, New Delhi remains committed to its dubious goal of isolating Pakistan in the shadow of the Pahalgam episode.",
  "content": "LONDON: A large pro-Pakistan demonstration was held on Saturday outside the Indian High Commission in Aldwych, London, under the aegis of Pakistan Muslim League-N’s UK chapter. The protest came in the wake of the deadly April 22 attack in Pahalgam, Occupied Kashmir, which left 26 people dead and reignited tensions between India and Pakistan. India has accused Pakistan of involvement in the attack, an allegation Islamabad has firmly denied, instead calling for an independent and impartial investigation into the incident. Waving Pakistan flags and placards, demonstrators chanted slogans including, “Gen Asim Munir Zindabad”, “Pakistan Zindabad”, “Kashmir belongs to Pakistan” and “We condemn Indian terrorism”.  The protesters also denounced India Prime Minister Narendra Modi and the Hindutva ideology, with chants of “Modi is terrorist” and “Down with Hindutva ideology” echoing through the streets. PML-N UK President Ahsan Dar addressed the protesters, saying:“ This huge show is a reflection of the sentiment Pakistani overseas have for their motherland. Today, Pakistanis from across the UK have gathered outside India House to express their support for the civilian and military leadership of Pakistan. He added that India had hastily blamed Pakistan for the Pahalgam attack without presenting any evidence. “It’s clear this was a false flag operation aimed at maligning Pakistan.” Dar also highlighted the unity among the diaspora community. “We countered Indian protesters on April 25 in large numbers. We are glad that activists of PTI, PML-N and other parties joined us against Indian aggression. The whole nation is united.” The demonstration remained peaceful but drew significant attention from passersby and local media. London Police maintained a visible presence to ensure order. Published in Dawn, May 4th, 2025",
  "scraped_at": "2025-05-04T11:53:59.613866"
}