{
  "title": "Warren Buffett to step down as Berkshire CEO, Vice Chairman Abel to take over",
  "url": "https://www.dawn.com/news/1908217/warren-buffett-to-step-down-as-berkshire-ceo-vice-chairman-abel-to-take-over",
  "published_date": "Published\nMay 3, 2025\n \n\nUpdated\n\nMay 3, 2025\n11:40pm",
  "summary": "This World Press Freedom Day, we pay tribute to the over 250 brave journalists who laid down their lives in Gaza in pursuit of the truth since Oct 7, 2023.",
  "content": "Influential billionaire investor Warren Buffett said on Saturday he will step down as chief executive of Berkshire Hathaway at the end of the year, and hand over the reins to Vice Chairman Greg Abel. “I think the time has arrived where Greg should become the chief executive of the company at year end,” Buffett, 94, said at Berkshire’s annual meeting. He said Abel hadn’t been aware of his plans prior to the announcement. Buffett also said he had “zero” intention of selling any of his Berkshire stock. The news was also unexpected, though Buffett said he had told his children about his decision. During his 60-year run, Buffett managed to transform Berkshire Hathaway from a medium-sized textile company when he bought it in the 1960s into a giant conglomerate, now valued at more than $1 trillion and with liquid assets of $300 billion. His success, coupled with his ability to explain his thinking in clear soundbites, has made him highly influential in the business and financial communities, earning him the nickname “The Oracle of Omaha”. Separately, the influential billionaire investor said that “trade should not be a weapon”, in remarks clearly targeting US President Donald Trump’s aggressive use of tariffs against countries around the world. “There is no question that trade can be an act of war,” the renowned businessman told the annual shareholder meeting. While he did not mention Trump by name, his meaning was unmistakable, and his comments came as analysts in the United States and abroad have expressed growing concern that tariffs could seriously slow global growth.  Two months ago, Buffett told a CBS interviewer that tariffs “are a tax on goods” — and not a relatively painless revenue-raiser, as Trump has suggested — adding, “I mean, the Tooth Fairy doesn’t pay ’em!” Buffett urged Washington to continue trading with the rest of the world, saying, “We should do what we do best and they should do what they do best. That’s what we did originally.” Achieving prosperity is not a zero-sum game, with one country’s successes meaning another’s losses, he said, adding that both can prosper. “I do think that the more prosperous the rest of the world becomes, it won’t be at our expense; the more prosperous we’ll become, and the safer we’ll feel,” Buffett said. He added that it can be dangerous for one country to offend the rest of the world while claiming superiority. “It’s a big mistake, in my view, when you have seven and a half billion people that don’t like you very well, and you got 300 million that are crowing in some way about how well they’ve done,” Buffett said. Compared to that dynamic, the financial markets’ recent gyrations are “really nothing”. Berkshire Hathaway on Saturday reported first-quarter profits of $9.6bn, down 14 per cent. That works out to $4.47 per share, also down sharply.",
  "scraped_at": "2025-05-04T02:11:46.496347"
}